*** crates/spoolq-core/src/queue.rs:511:9: replace Queue::wall_floor_for_mutation -> Result<u64, Error> with Ok(0)

*** mutation diff:
--- crates/spoolq-core/src/queue.rs
+++ replace Queue::wall_floor_for_mutation -> Result<u64, Error> with Ok(0)
@@ -503,23 +503,17 @@
 
     fn poison(&mut self) {
         self.poisoned = true;
     }
     /// Compute the effective wall floor: max(CLOCK_REALTIME, stored watermark bucket * width)
     /// Wall floor for mutating operations. P0-01: Returns Err and poisons
     /// on failure so callers abort before computing destination paths.
     pub(crate) fn wall_floor_for_mutation(&mut self) -> Result<u64, Error> {
-        match self.effective_wall_floor_ns_checked() {
-            Ok(ns) => Ok(ns),
-            Err(e) => {
-                self.poison();
-                Err(e)
-            }
-        }
+        Ok(0) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Wall floor for read-only or recovery operations. Falls back to raw
     /// CLOCK_REALTIME on error without poisoning, since recovery must continue.
     pub(crate) fn effective_wall_floor_ns(&self) -> u64 {
         match self.effective_wall_floor_ns_checked() {
             Ok(ns) => ns,
             Err(_) => spoolq_fs_linux::clock_realtime_ns().unwrap_or(0),

---- queue::tests::ack_conflicting_receipt_is_not_already_acked stdout ----

thread 'queue::tests::ack_conflicting_receipt_is_not_already_acked' panicked at crates/spoolq-core/src/queue.rs:5267:34:
conflicting receipt should not be Acked

---- queue::tests::ack_already_lost_returns_lease_lost stdout ----

thread 'queue::tests::ack_already_lost_returns_lease_lost' panicked at crates/spoolq-core/src/queue.rs:3816:9:
assertion failed: matches!(result, AckOutcome::AlreadyAcked)

---- queue::tests::ack_on_gone_source_returns_already_acked stdout ----

thread 'queue::tests::ack_on_gone_source_returns_already_acked' panicked at crates/spoolq-core/src/queue.rs:5321:9:
second ack should be AlreadyAcked, got LeaseLost

failures:
    queue::tests::ack_already_lost_returns_lease_lost
    queue::tests::ack_conflicting_receipt_is_not_already_acked
    queue::tests::ack_on_gone_source_returns_already_acked
    queue::tests::ack_unverified_eexist_triggers_not_committed

test result: FAILED. 91 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 3.12s

*** result: Failure(101)
