*** crates/spoolq-core/src/queue.rs:135:12: delete ! in Queue::init

*** mutation diff:
--- crates/spoolq-core/src/queue.rs
+++ delete ! in Queue::init
@@ -127,17 +127,17 @@
 impl Queue {
     /// Initialize a new queue at the given path.
     pub fn init(root: &Path, opts: &CreateOptions) -> io::Result<FormatRecord> {
         // C-01: Validate all options before any filesystem mutation
         validate_create_options(opts)
             .map_err(|e| io::Error::new(io::ErrorKind::InvalidInput, e.to_string()))?;
 
         // Create root directory if needed
-        if !root.exists() {
+        if  /* ~ changed by cargo-mutants ~ */root.exists() {
             std::fs::create_dir_all(root)?;
             // Sync the parent directory so the root entry persists
             if let Some(parent) = root.parent() {
                 let parent_fd = fs::open_dir_absolute(parent)?;
                 fs::fsync_dir_fd(parent_fd.as_raw_fd())?;
             }
         }

*** result: Success
