*** crates/spoolq-core/src/queue.rs:176:17: replace Queue::init::<impl Drop for InitGuard>::drop with ()

*** mutation diff:
--- crates/spoolq-core/src/queue.rs
+++ replace Queue::init::<impl Drop for InitGuard>::drop with ()
@@ -168,20 +168,17 @@
 
         // R2-B01: Use RAII guard to clean up the init marker on any failure.
         struct InitGuard {
             root_fd: std::os::unix::io::RawFd,
             armed: bool,
         }
         impl Drop for InitGuard {
             fn drop(&mut self) {
-                if self.armed {
-                    // Remove the marker so a failed init can be retried
-                    let _ = fs::unlinkat(self.root_fd, ".initializing");
-                }
+                () /* ~ changed by cargo-mutants ~ */
             }
         }
         let mut init_guard = InitGuard {
             root_fd: root_fd.as_raw_fd(),
             armed: true,
         };
 
         // R2-B01: Create control/ early so we can hold the maintenance lock

*** result: Success
