*** crates/spoolq-core/src/queue.rs:210:12: delete ! in Queue::init

*** mutation diff:
--- crates/spoolq-core/src/queue.rs
+++ delete ! in Queue::init
@@ -202,17 +202,17 @@
         })?;
         let lock_fd = fs::openat(
             control_fd.as_raw_fd(),
             "maintenance.lock",
             libc::O_RDWR,
             0o600,
         )?;
         let locked = fs::try_ofd_write_lock(lock_fd.as_raw_fd())?;
-        if !locked {
+        if  /* ~ changed by cargo-mutants ~ */locked {
             return Err(io::Error::new(
                 io::ErrorKind::WouldBlock,
                 "another initializer or maintenance process holds the lock",
             ));
         }
         // H1: Hold the maintenance lock for the duration of init by binding it.
         // It will be released when _init_lock goes out of scope at function end.
         let _init_lock = lock_fd;

---- quarantine::tests::fsck_deep_verifies_payload stdout ----

thread 'quarantine::tests::fsck_deep_verifies_payload' panicked at crates/spoolq-core/src/quarantine.rs:894:60:
called `Result::unwrap()` on an `Err` value: Custom { kind: WouldBlock, error: "another initializer or maintenance process holds the lock" }

---- quarantine::tests::fsck_clean_queue stdout ----

thread 'quarantine::tests::fsck_clean_queue' panicked at crates/spoolq-core/src/quarantine.rs:843:60:
called `Result::unwrap()` on an `Err` value: Custom { kind: WouldBlock, error: "another initializer or maintenance process holds the lock" }

---- quarantine::tests::fsck_detects_header_corruption stdout ----

thread 'quarantine::tests::fsck_detects_header_corruption' panicked at crates/spoolq-core/src/quarantine.rs:932:60:
called `Result::unwrap()` on an `Err` value: Custom { kind: WouldBlock, error: "another initializer or maintenance process holds the lock" }

failures:
    quarantine::tests::fsck_clean_queue
    quarantine::tests::fsck_deep_verifies_payload
    quarantine::tests::fsck_detects_header_corruption
    quarantine::tests::fsck_finds_valid_job
    quarantine::tests::fsck_repair_quarantines_corrupt_header
    queue::tests::ack_accepts_verified_lease
    queue::tests::ack_already_lost_returns_lease_lost
    queue::tests::ack_conflicting_receipt_is_not_already_acked
    queue::tests::ack_preserves_error_categories
    queue::tests::ack_succeeds_without_explicit_verify
    queue::tests::ack_verified_fd_dev_ino_check
    queue::tests::bury_after_lease

test result: FAILED. 12 passed; 77 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
