*** crates/spoolq-core/src/queue.rs:266:33: replace == with != in Queue::init

*** mutation diff:
--- crates/spoolq-core/src/queue.rs
+++ replace == with != in Queue::init
@@ -258,17 +258,17 @@
         // Sync root
         fs::fsync_dir_fd(root_fd.as_raw_fd())?;
 
         // Create control lock files
         let control_fd = fs::open_directory(root_fd.as_raw_fd(), "control")?;
         for lock_file in ["maintenance.lock", "wall-watermark.lock"] {
             let fd =
                 fs::create_exclusive(control_fd.as_raw_fd(), lock_file, 0o600).or_else(|e| {
-                    if e.kind() == io::ErrorKind::AlreadyExists {
+                    if e.kind() != /* ~ changed by cargo-mutants ~ */ io::ErrorKind::AlreadyExists {
                         fs::openat(control_fd.as_raw_fd(), lock_file, 0o2, 0o600)
                     } else {
                         Err(e)
                     }
                 })?;
             fs::fsync(fd.as_raw_fd())?;
         }
         fs::fsync_dir_fd(control_fd.as_raw_fd())?;

---- quarantine::tests::fsck_clean_queue stdout ----

thread 'quarantine::tests::fsck_clean_queue' panicked at crates/spoolq-core/src/quarantine.rs:843:60:
called `Result::unwrap()` on an `Err` value: Os { code: 17, kind: AlreadyExists, message: "File exists" }

---- quarantine::tests::fsck_deep_verifies_payload stdout ----

thread 'quarantine::tests::fsck_deep_verifies_payload' panicked at crates/spoolq-core/src/quarantine.rs:894:60:
called `Result::unwrap()` on an `Err` value: Os { code: 17, kind: AlreadyExists, message: "File exists" }

---- queue::tests::ack_accepts_verified_lease stdout ----

thread 'queue::tests::ack_accepts_verified_lease' panicked at crates/spoolq-core/src/queue.rs:3574:54:
called `Result::unwrap()` on an `Err` value: Os { code: 17, kind: AlreadyExists, message: "File exists" }

failures:
    quarantine::tests::fsck_clean_queue
    quarantine::tests::fsck_deep_verifies_payload
    quarantine::tests::fsck_detects_header_corruption
    quarantine::tests::fsck_finds_valid_job
    quarantine::tests::fsck_repair_quarantines_corrupt_header
    queue::tests::ack_accepts_verified_lease
    queue::tests::ack_already_lost_returns_lease_lost
    queue::tests::ack_conflicting_receipt_is_not_already_acked
    queue::tests::ack_preserves_error_categories
    queue::tests::ack_succeeds_without_explicit_verify
    queue::tests::ack_verified_fd_dev_ino_check
    queue::tests::bury_after_lease

test result: FAILED. 12 passed; 77 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
