*** crates/spoolq-core/src/queue.rs:324:23: replace match guard e.kind() == io::ErrorKind::AlreadyExists with true in Queue::init

*** mutation diff:
--- crates/spoolq-core/src/queue.rs
+++ replace match guard e.kind() == io::ErrorKind::AlreadyExists with true in Queue::init
@@ -316,17 +316,17 @@
         // initializers cannot overwrite each other.
         match fs::renameat2_noreplace(
             root_fd.as_raw_fd(),
             &fmt_tmp_name,
             root_fd.as_raw_fd(),
             "FORMAT",
         ) {
             Ok(()) => {}
-            Err(e) if e.kind() == io::ErrorKind::AlreadyExists => {
+            Err(e) if true /* ~ changed by cargo-mutants ~ */ => {
                 // Another initializer won the race. Clean up our temp and bail.
                 let _ = fs::unlinkat(root_fd.as_raw_fd(), &fmt_tmp_name);
                 return Err(io::Error::new(
                     io::ErrorKind::AlreadyExists,
                     "another initializer published FORMAT first",
                 ));
             }
             Err(e) => return Err(e),

*** result: Success
