*** crates/spoolq-core/src/queue.rs:324:32: replace == with != in Queue::init

*** mutation diff:
--- crates/spoolq-core/src/queue.rs
+++ replace == with != in Queue::init
@@ -316,17 +316,17 @@
         // initializers cannot overwrite each other.
         match fs::renameat2_noreplace(
             root_fd.as_raw_fd(),
             &fmt_tmp_name,
             root_fd.as_raw_fd(),
             "FORMAT",
         ) {
             Ok(()) => {}
-            Err(e) if e.kind() == io::ErrorKind::AlreadyExists => {
+            Err(e) if e.kind() != /* ~ changed by cargo-mutants ~ */ io::ErrorKind::AlreadyExists => {
                 // Another initializer won the race. Clean up our temp and bail.
                 let _ = fs::unlinkat(root_fd.as_raw_fd(), &fmt_tmp_name);
                 return Err(io::Error::new(
                     io::ErrorKind::AlreadyExists,
                     "another initializer published FORMAT first",
                 ));
             }
             Err(e) => return Err(e),

---- queue::tests::fd_leak_stress stdout ----

thread 'queue::tests::fd_leak_stress' panicked at crates/spoolq-core/src/queue.rs:4906:9:
FD leak: baseline=88, after=126

failures:
    queue::tests::fd_leak_stress

test result: FAILED. 88 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 3.10s

*** result: Failure(101)
