*** crates/spoolq-core/src/queue.rs:354:45: replace != with == in Queue::open

*** mutation diff:
--- crates/spoolq-core/src/queue.rs
+++ replace != with == in Queue::open
@@ -346,17 +346,17 @@
     /// Open an existing queue.
     pub fn open(root: &Path, opts: &OpenOptions) -> Result<Self, Error> {
         // B-11: Open root first using descriptor-relative, no-symlink semantics
         let root_fd = fs::open_dir_absolute(root).map_err(|e| Error::IoFailure(e.to_string()))?;
 
         // B-11: Validate root is a directory
         let root_stat =
             fs::fstat(root_fd.as_raw_fd()).map_err(|e| Error::IoFailure(e.to_string()))?;
-        if root_stat.st_mode & libc::S_IFMT != libc::S_IFDIR {
+        if root_stat.st_mode & libc::S_IFMT == /* ~ changed by cargo-mutants ~ */ libc::S_IFDIR {
             return Err(Error::QueueCorrupt("root path is not a directory".into()));
         }
 
         // B-11: Read FORMAT through descriptor-relative open, not pathname
         let format_fd = fs::openat(root_fd.as_raw_fd(), "FORMAT", libc::O_RDONLY, 0)
             .map_err(|e| Error::IoFailure(e.to_string()))?;
         let mut format_bytes = Vec::new();
         {

---- quarantine::tests::fsck_repair_quarantines_corrupt_header stdout ----

thread 'quarantine::tests::fsck_repair_quarantines_corrupt_header' panicked at crates/spoolq-core/src/quarantine.rs:990:10:
called `Result::unwrap()` on an `Err` value: QueueCorrupt("root path is not a directory")

---- queue::tests::concurrent_producers_consumers stdout ----

thread '<unnamed>' panicked at crates/spoolq-core/src/queue.rs:3978:18:
called `Result::unwrap()` on an `Err` value: QueueCorrupt("root path is not a directory")

thread '<unnamed>' panicked at crates/spoolq-core/src/queue.rs:3978:18:
called `Result::unwrap()` on an `Err` value: QueueCorrupt("root path is not a directory")

thread 'queue::tests::concurrent_producers_consumers' panicked at crates/spoolq-core/src/queue.rs:3994:22:
called `Result::unwrap()` on an `Err` value: Any { .. }

thread '<unnamed>' panicked at crates/spoolq-core/src/queue.rs:3978:18:
called `Result::unwrap()` on an `Err` value: QueueCorrupt("root path is not a directory")

---- quarantine::tests::fsck_clean_queue stdout ----

thread 'quarantine::tests::fsck_clean_queue' panicked at crates/spoolq-core/src/quarantine.rs:851:10:
called `Result::unwrap()` on an `Err` value: QueueCorrupt("root path is not a directory")

failures:
    quarantine::tests::fsck_clean_queue
    quarantine::tests::fsck_deep_verifies_payload
    quarantine::tests::fsck_detects_header_corruption
    quarantine::tests::fsck_finds_valid_job
    quarantine::tests::fsck_repair_quarantines_corrupt_header
    queue::tests::ack_accepts_verified_lease
    queue::tests::ack_already_lost_returns_lease_lost
    queue::tests::ack_conflicting_receipt_is_not_already_acked
    queue::tests::ack_preserves_error_categories
    queue::tests::ack_succeeds_without_explicit_verify
    queue::tests::ack_verified_fd_dev_ino_check
    queue::tests::bury_after_lease

test result: FAILED. 16 passed; 73 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.10s

*** result: Failure(101)
