*** crates/spoolq-core/src/queue.rs:373:13: delete match arm spoolq_format::FormatError::BadMagic | spoolq_format::FormatError::WrongSize{..} in Queue::open

*** mutation diff:
--- crates/spoolq-core/src/queue.rs
+++ delete match arm spoolq_format::FormatError::BadMagic | spoolq_format::FormatError::WrongSize{..} in Queue::open
@@ -365,19 +365,17 @@
                 match fs::read(format_fd.as_raw_fd(), &mut buf) {
                     Ok(0) => break,
                     Ok(n) => format_bytes.extend_from_slice(&buf[..n]),
                     Err(e) => return Err(Error::IoFailure(e.to_string())),
                 }
             }
         }
         let format_rec = FormatRecord::decode(&format_bytes).map_err(|e| match e {
-            spoolq_format::FormatError::BadMagic | spoolq_format::FormatError::WrongSize { .. } => {
-                Error::QueueCorrupt(format!("FORMAT decode: {e}"))
-            }
+             /* ~ changed by cargo-mutants ~ */
             spoolq_format::FormatError::UnsupportedVersion(_, _) => Error::UnsupportedFormat,
             spoolq_format::FormatError::DigestMismatch => {
                 Error::QueueCorrupt("FORMAT digest mismatch".into())
             }
             _ => Error::QueueCorrupt(format!("FORMAT decode: {e}")),
         })?;
 
         // Validate retention bound: ceil(retention / terminal_width) + 2 <= 4096

*** result: Success
