*** crates/spoolq-core/src/queue.rs:390:24: replace > with < in Queue::open

*** mutation diff:
--- crates/spoolq-core/src/queue.rs
+++ replace > with < in Queue::open
@@ -382,17 +382,17 @@
 
         // Validate retention bound: ceil(retention / terminal_width) + 2 <= 4096
         let probe_count = ceiling_bucket(
             opts.receipt_retention_ns,
             format_rec.terminal_bucket_width_ns,
         )
         .unwrap_or(0)
         .saturating_add(2);
-        if probe_count > 4096 {
+        if probe_count < /* ~ changed by cargo-mutants ~ */ 4096 {
             return Err(Error::InvalidInput(
                 "receipt retention exceeds duplicate-ack probe bound".into(),
             ));
         }
 
         // Check filesystem type
         if !opts.allow_unsupported_fs {
             let magic = fs::statfs(root).map_err(|e| Error::IoFailure(e.to_string()))?;

---- quarantine::tests::fsck_deep_verifies_payload stdout ----

thread 'quarantine::tests::fsck_deep_verifies_payload' panicked at crates/spoolq-core/src/quarantine.rs:902:10:
called `Result::unwrap()` on an `Err` value: InvalidInput("receipt retention exceeds duplicate-ack probe bound")

---- queue::tests::enqueue_delayed stdout ----

thread 'queue::tests::enqueue_delayed' panicked at crates/spoolq-core/src/queue.rs:3582:10:
called `Result::unwrap()` on an `Err` value: InvalidInput("receipt retention exceeds duplicate-ack probe bound")

---- queue::tests::enqueue_large_payload stdout ----

thread 'queue::tests::enqueue_large_payload' panicked at crates/spoolq-core/src/queue.rs:3582:10:
called `Result::unwrap()` on an `Err` value: InvalidInput("receipt retention exceeds duplicate-ack probe bound")

failures:
    quarantine::tests::fsck_clean_queue
    quarantine::tests::fsck_deep_verifies_payload
    quarantine::tests::fsck_detects_header_corruption
    quarantine::tests::fsck_finds_valid_job
    quarantine::tests::fsck_repair_quarantines_corrupt_header
    queue::tests::ack_accepts_verified_lease
    queue::tests::ack_already_lost_returns_lease_lost
    queue::tests::ack_conflicting_receipt_is_not_already_acked
    queue::tests::ack_preserves_error_categories
    queue::tests::ack_succeeds_without_explicit_verify
    queue::tests::ack_verified_fd_dev_ino_check
    queue::tests::bury_after_lease

test result: FAILED. 16 passed; 73 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
