*** crates/spoolq-core/src/queue.rs:401:17: delete match arm fs::EXT4_SUPER_MAGIC | fs::XFS_SUPER_MAGIC in Queue::open

*** mutation diff:
--- crates/spoolq-core/src/queue.rs
+++ delete match arm fs::EXT4_SUPER_MAGIC | fs::XFS_SUPER_MAGIC in Queue::open
@@ -393,17 +393,17 @@
             ));
         }
 
         // Check filesystem type
         if !opts.allow_unsupported_fs {
             let magic = fs::statfs(root).map_err(|e| Error::IoFailure(e.to_string()))?;
             let ft = magic.f_type as i64;
             match ft {
-                fs::EXT4_SUPER_MAGIC | fs::XFS_SUPER_MAGIC => {}
+                 /* ~ changed by cargo-mutants ~ */
                 fs::TMPFS_MAGIC => {
                     return Err(Error::UnsupportedFilesystem);
                 }
                 fs::NFS_SUPER_MAGIC | fs::FUSE_SUPER_MAGIC | fs::OVERLAYFS_SUPER_MAGIC => {
                     return Err(Error::UnsupportedFilesystem);
                 }
                 _ => {
                     return Err(Error::UnsupportedFilesystem);

*** result: Success
