*** crates/spoolq-core/src/queue.rs:432:37: replace & with ^ in Queue::open

*** mutation diff:
--- crates/spoolq-core/src/queue.rs
+++ replace & with ^ in Queue::open
@@ -424,17 +424,17 @@
         ] {
             match fs::fstatat(root_fd.as_raw_fd(), state_dir) {
                 Ok(stat) => {
                     if stat.st_dev != root_stat.st_dev {
                         return Err(Error::QueueCorrupt(format!(
                             "state directory '{state_dir}' is on a different device than root"
                         )));
                     }
-                    if stat.st_mode & libc::S_IFMT != libc::S_IFDIR {
+                    if stat.st_mode ^ /* ~ changed by cargo-mutants ~ */ libc::S_IFMT != libc::S_IFDIR {
                         return Err(Error::QueueCorrupt(format!(
                             "state path '{state_dir}' is not a directory"
                         )));
                     }
                 }
                 Err(_) => {
                     return Err(Error::QueueCorrupt(format!(
                         "required state directory '{state_dir}' is missing"

---- quarantine::tests::fsck_finds_valid_job stdout ----

thread 'quarantine::tests::fsck_finds_valid_job' panicked at crates/spoolq-core/src/quarantine.rs:868:10:
called `Result::unwrap()` on an `Err` value: QueueCorrupt("state path 'control' is not a directory")

---- queue::tests::bury_after_lease stdout ----

thread 'queue::tests::bury_after_lease' panicked at crates/spoolq-core/src/queue.rs:3582:10:
called `Result::unwrap()` on an `Err` value: QueueCorrupt("state path 'control' is not a directory")

---- queue::tests::ack_accepts_verified_lease stdout ----

thread 'queue::tests::ack_accepts_verified_lease' panicked at crates/spoolq-core/src/queue.rs:3582:10:
called `Result::unwrap()` on an `Err` value: QueueCorrupt("state path 'control' is not a directory")

failures:
    quarantine::tests::fsck_clean_queue
    quarantine::tests::fsck_deep_verifies_payload
    quarantine::tests::fsck_detects_header_corruption
    quarantine::tests::fsck_finds_valid_job
    quarantine::tests::fsck_repair_quarantines_corrupt_header
    queue::tests::ack_accepts_verified_lease
    queue::tests::ack_already_lost_returns_lease_lost
    queue::tests::ack_conflicting_receipt_is_not_already_acked
    queue::tests::ack_preserves_error_categories
    queue::tests::ack_succeeds_without_explicit_verify
    queue::tests::ack_verified_fd_dev_ino_check
    queue::tests::bury_after_lease

test result: FAILED. 16 passed; 73 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.09s

*** result: Failure(101)
