*** crates/spoolq-core/src/queue.rs:459:12: delete ! in Queue::open

*** mutation diff:
--- crates/spoolq-core/src/queue.rs
+++ delete ! in Queue::open
@@ -451,17 +451,17 @@
         // Generate worker nonce
         let worker_nonce = fs::random_128bit().map_err(|e| Error::IoFailure(e.to_string()))?;
 
         // Acquire shared maintenance lock
         let maint_fd = fs::openat(root_fd.as_raw_fd(), "control/maintenance.lock", 0o0, 0o600)
             .map_err(|e| Error::IoFailure(e.to_string()))?;
         let locked = fs::try_ofd_read_lock(maint_fd.as_raw_fd())
             .map_err(|e| Error::IoFailure(e.to_string()))?;
-        if !locked {
+        if  /* ~ changed by cargo-mutants ~ */locked {
             return Err(Error::MaintenanceBusy);
         }
         Ok(Queue {
             root_fd,
             root_path: root.to_path_buf(),
             format: format_rec,
             boot_id,
             boot_id_bytes: boot_id_bin,

---- queue::tests::empty_queue_returns_empty_not_error stdout ----

thread 'queue::tests::empty_queue_returns_empty_not_error' panicked at crates/spoolq-core/src/queue.rs:3582:10:
called `Result::unwrap()` on an `Err` value: MaintenanceBusy

---- quarantine::tests::fsck_deep_verifies_payload stdout ----

thread 'quarantine::tests::fsck_deep_verifies_payload' panicked at crates/spoolq-core/src/quarantine.rs:902:10:
called `Result::unwrap()` on an `Err` value: MaintenanceBusy

---- quarantine::tests::fsck_clean_queue stdout ----

thread 'quarantine::tests::fsck_clean_queue' panicked at crates/spoolq-core/src/quarantine.rs:851:10:
called `Result::unwrap()` on an `Err` value: MaintenanceBusy

failures:
    quarantine::tests::fsck_clean_queue
    quarantine::tests::fsck_deep_verifies_payload
    quarantine::tests::fsck_detects_header_corruption
    quarantine::tests::fsck_finds_valid_job
    quarantine::tests::fsck_repair_quarantines_corrupt_header
    queue::tests::ack_accepts_verified_lease
    queue::tests::ack_already_lost_returns_lease_lost
    queue::tests::ack_conflicting_receipt_is_not_already_acked
    queue::tests::ack_preserves_error_categories
    queue::tests::ack_succeeds_without_explicit_verify
    queue::tests::ack_verified_fd_dev_ino_check
    queue::tests::bury_after_lease

test result: FAILED. 16 passed; 73 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.08s

*** result: Failure(101)
