*** crates/spoolq-core/src/queue.rs:47:5: replace validate_create_options -> Result<(), Error> with Ok(())

*** mutation diff:
--- crates/spoolq-core/src/queue.rs
+++ replace validate_create_options -> Result<(), Error> with Ok(())
@@ -39,41 +39,17 @@
             max_payload_length: MAX_PAYLOAD_LENGTH,
         }
     }
 }
 
 /// Validate all CreateOptions before any filesystem mutation (C-01).
 /// Same validation used in encoding and tests.
 pub fn validate_create_options(opts: &CreateOptions) -> Result<(), Error> {
-    if opts.shard_count == 0 || !opts.shard_count.is_power_of_two() || opts.shard_count > 4096 {
-        return Err(Error::InvalidInput("invalid shard count".into()));
-    }
-    if opts.lease_bucket_width_ns == 0 {
-        return Err(Error::InvalidInput(
-            "lease bucket width must be non-zero".into(),
-        ));
-    }
-    if opts.delayed_bucket_width_ns == 0 {
-        return Err(Error::InvalidInput(
-            "delayed bucket width must be non-zero".into(),
-        ));
-    }
-    if opts.terminal_bucket_width_ns == 0 {
-        return Err(Error::InvalidInput(
-            "terminal bucket width must be non-zero".into(),
-        ));
-    }
-    if !(60_000_000_000..=86_400_000_000_000).contains(&opts.terminal_bucket_width_ns) {
-        return Err(Error::InvalidInput("invalid terminal bucket width".into()));
-    }
-    if opts.max_payload_length > MAX_PAYLOAD_LENGTH {
-        return Err(Error::InvalidInput("payload limit exceeds maximum".into()));
-    }
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 /// Operational options for opening a queue.
 #[derive(Clone, Debug)]
 pub struct OpenOptions {
     pub allow_unsupported_fs: bool,
     pub receipt_retention_ns: u64,
     pub temporary_file_ttl_ns: u64,

---- queue::tests::init_validates_zero_lease_width stdout ----

thread 'queue::tests::init_validates_zero_lease_width' panicked at crates/spoolq-core/src/queue.rs:4398:9:
assertion failed: Queue::init(tmp.path(), &opts).is_err()

failures:
    queue::tests::init_validates_zero_lease_width

test result: FAILED. 88 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 3.11s

*** result: Failure(101)
