*** crates/spoolq-core/src/queue.rs:55:37: replace == with != in validate_create_options

*** mutation diff:
--- crates/spoolq-core/src/queue.rs
+++ replace == with != in validate_create_options
@@ -47,17 +47,17 @@
     if opts.shard_count == 0 || !opts.shard_count.is_power_of_two() || opts.shard_count > 4096 {
         return Err(Error::InvalidInput("invalid shard count".into()));
     }
     if opts.lease_bucket_width_ns == 0 {
         return Err(Error::InvalidInput(
             "lease bucket width must be non-zero".into(),
         ));
     }
-    if opts.delayed_bucket_width_ns == 0 {
+    if opts.delayed_bucket_width_ns != /* ~ changed by cargo-mutants ~ */ 0 {
         return Err(Error::InvalidInput(
             "delayed bucket width must be non-zero".into(),
         ));
     }
     if opts.terminal_bucket_width_ns == 0 {
         return Err(Error::InvalidInput(
             "terminal bucket width must be non-zero".into(),
         ));

---- quarantine::tests::fsck_clean_queue stdout ----

thread 'quarantine::tests::fsck_clean_queue' panicked at crates/spoolq-core/src/quarantine.rs:843:60:
called `Result::unwrap()` on an `Err` value: Custom { kind: InvalidInput, error: "invalid input: delayed bucket width must be non-zero" }

---- quarantine::tests::fsck_deep_verifies_payload stdout ----

thread 'quarantine::tests::fsck_deep_verifies_payload' panicked at crates/spoolq-core/src/quarantine.rs:894:60:
called `Result::unwrap()` on an `Err` value: Custom { kind: InvalidInput, error: "invalid input: delayed bucket width must be non-zero" }

---- quarantine::tests::fsck_detects_header_corruption stdout ----

thread 'quarantine::tests::fsck_detects_header_corruption' panicked at crates/spoolq-core/src/quarantine.rs:932:60:
called `Result::unwrap()` on an `Err` value: Custom { kind: InvalidInput, error: "invalid input: delayed bucket width must be non-zero" }

failures:
    quarantine::tests::fsck_clean_queue
    quarantine::tests::fsck_deep_verifies_payload
    quarantine::tests::fsck_detects_header_corruption
    quarantine::tests::fsck_finds_valid_job
    quarantine::tests::fsck_repair_quarantines_corrupt_header
    queue::tests::ack_accepts_verified_lease
    queue::tests::ack_already_lost_returns_lease_lost
    queue::tests::ack_conflicting_receipt_is_not_already_acked
    queue::tests::ack_preserves_error_categories
    queue::tests::ack_succeeds_without_explicit_verify
    queue::tests::ack_verified_fd_dev_ino_check
    queue::tests::bury_after_lease

test result: FAILED. 12 passed; 77 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
