*** crates/spoolq-core/src/queue.rs:65:8: delete ! in validate_create_options

*** mutation diff:
--- crates/spoolq-core/src/queue.rs
+++ delete ! in validate_create_options
@@ -57,17 +57,17 @@
             "delayed bucket width must be non-zero".into(),
         ));
     }
     if opts.terminal_bucket_width_ns == 0 {
         return Err(Error::InvalidInput(
             "terminal bucket width must be non-zero".into(),
         ));
     }
-    if !(60_000_000_000..=86_400_000_000_000).contains(&opts.terminal_bucket_width_ns) {
+    if  /* ~ changed by cargo-mutants ~ */(60_000_000_000..=86_400_000_000_000).contains(&opts.terminal_bucket_width_ns) {
         return Err(Error::InvalidInput("invalid terminal bucket width".into()));
     }
     if opts.max_payload_length > MAX_PAYLOAD_LENGTH {
         return Err(Error::InvalidInput("payload limit exceeds maximum".into()));
     }
     Ok(())
 }

---- quarantine::tests::fsck_clean_queue stdout ----

thread 'quarantine::tests::fsck_clean_queue' panicked at crates/spoolq-core/src/quarantine.rs:843:60:
called `Result::unwrap()` on an `Err` value: Custom { kind: InvalidInput, error: "invalid input: invalid terminal bucket width" }

---- quarantine::tests::fsck_deep_verifies_payload stdout ----

thread 'quarantine::tests::fsck_deep_verifies_payload' panicked at crates/spoolq-core/src/quarantine.rs:894:60:
called `Result::unwrap()` on an `Err` value: Custom { kind: InvalidInput, error: "invalid input: invalid terminal bucket width" }

---- quarantine::tests::fsck_detects_header_corruption stdout ----

thread 'quarantine::tests::fsck_detects_header_corruption' panicked at crates/spoolq-core/src/quarantine.rs:932:60:
called `Result::unwrap()` on an `Err` value: Custom { kind: InvalidInput, error: "invalid input: invalid terminal bucket width" }

failures:
    quarantine::tests::fsck_clean_queue
    quarantine::tests::fsck_deep_verifies_payload
    quarantine::tests::fsck_detects_header_corruption
    quarantine::tests::fsck_finds_valid_job
    quarantine::tests::fsck_repair_quarantines_corrupt_header
    queue::tests::ack_accepts_verified_lease
    queue::tests::ack_already_lost_returns_lease_lost
    queue::tests::ack_conflicting_receipt_is_not_already_acked
    queue::tests::ack_preserves_error_categories
    queue::tests::ack_succeeds_without_explicit_verify
    queue::tests::ack_verified_fd_dev_ino_check
    queue::tests::bury_after_lease

test result: FAILED. 12 passed; 77 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
