*** crates/spoolq-core/src/queue.rs:68:32: replace > with == in validate_create_options

*** mutation diff:
--- crates/spoolq-core/src/queue.rs
+++ replace > with == in validate_create_options
@@ -60,17 +60,17 @@
     if opts.terminal_bucket_width_ns == 0 {
         return Err(Error::InvalidInput(
             "terminal bucket width must be non-zero".into(),
         ));
     }
     if !(60_000_000_000..=86_400_000_000_000).contains(&opts.terminal_bucket_width_ns) {
         return Err(Error::InvalidInput("invalid terminal bucket width".into()));
     }
-    if opts.max_payload_length > MAX_PAYLOAD_LENGTH {
+    if opts.max_payload_length == /* ~ changed by cargo-mutants ~ */ MAX_PAYLOAD_LENGTH {
         return Err(Error::InvalidInput("payload limit exceeds maximum".into()));
     }
     Ok(())
 }
 
 /// Operational options for opening a queue.
 #[derive(Clone, Debug)]
 pub struct OpenOptions {

---- quarantine::tests::fsck_clean_queue stdout ----

thread 'quarantine::tests::fsck_clean_queue' panicked at crates/spoolq-core/src/quarantine.rs:843:60:
called `Result::unwrap()` on an `Err` value: Custom { kind: InvalidInput, error: "invalid input: payload limit exceeds maximum" }

---- quarantine::tests::fsck_deep_verifies_payload stdout ----

thread 'quarantine::tests::fsck_deep_verifies_payload' panicked at crates/spoolq-core/src/quarantine.rs:894:60:
called `Result::unwrap()` on an `Err` value: Custom { kind: InvalidInput, error: "invalid input: payload limit exceeds maximum" }

---- quarantine::tests::fsck_detects_header_corruption stdout ----

thread 'quarantine::tests::fsck_detects_header_corruption' panicked at crates/spoolq-core/src/quarantine.rs:932:60:
called `Result::unwrap()` on an `Err` value: Custom { kind: InvalidInput, error: "invalid input: payload limit exceeds maximum" }

failures:
    quarantine::tests::fsck_clean_queue
    quarantine::tests::fsck_deep_verifies_payload
    quarantine::tests::fsck_detects_header_corruption
    quarantine::tests::fsck_finds_valid_job
    quarantine::tests::fsck_repair_quarantines_corrupt_header
    queue::tests::ack_accepts_verified_lease
    queue::tests::ack_already_lost_returns_lease_lost
    queue::tests::ack_conflicting_receipt_is_not_already_acked
    queue::tests::ack_preserves_error_categories
    queue::tests::ack_succeeds_without_explicit_verify
    queue::tests::ack_verified_fd_dev_ino_check
    queue::tests::bury_after_lease

test result: FAILED. 13 passed; 76 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
